import tensorflow as tf
import numpy as np
import matplotlib.pyplot as plt
from tensorflow.keras.layers import Embedding, LSTM, Dense, Bidirectional
from tensorflow.keras.models import Sequential
from tensorflow.keras.preprocessing.text import Tokenizer
from tensorflow.keras.preprocessing.sequence import pad_sequences

# Define the lyrics of the song
data = "In the town of Athy one Jeremy Lanigan \n Battered away til he hadnt a pound. \nHis father died and made him a man again \n Left him a farm and ten acres of ground. \nHe gave a grand party for friends and relations \nWho didnt forget him when come to the wall, \nAnd if youll but listen Ill make your eyes glisten \nOf the rows and the ructions of Lanigans Ball. \nMyself to be sure got free invitation, \nFor all the nice girls and boys I might ask, \nAnd just in a minute both friends and relations \nWere dancing round merry as bees round a cask. \nJudy ODaly, that nice little milliner, \nShe tipped me a wink for to give her a call, \nAnd I soon arrived with Peggy McGilligan \nJust in time for Lanigans Ball. \nThere were lashings of punch and wine for the ladies, \nPotatoes and cakes; there was bacon and tea, \nThere were the Nolans, Dolans, OGradys \nCourting the girls and dancing away. \nSongs they went round as plenty as water, \nThe harp that once sounded in Taras old hall,\nSweet Nelly Gray and The Rat Catchers Daughter,\nAll singing together at Lanigans Ball. \nThey were doing all kinds of nonsensical polkas \nAll round the room in a whirligig. \nJulia and I, we banished their nonsense \nAnd tipped them the twist of a reel and a jig. \nAch mavrone, how the girls got all mad at me \nDanced til youd think the ceiling would fall. \nFor I spent three weeks at Brooks Academy \nLearning new steps for Lanigans Ball. \nThree long weeks I spent up in Dublin, \nThree long weeks to learn nothing at all,\n Three long weeks I spent up in Dublin, \nLearning new steps for Lanigans Ball. \nShe stepped out and I stepped in again, \nI stepped out and she stepped in again, \nShe stepped out and I stepped in again, \nLearning new steps for Lanigans Ball. \nBoys were all merry and the girls they were hearty \nAnd danced all around in couples and groups, \nTil an accident happened, young Terrance McCarthy \nPut his right leg through miss Finnertys hoops. \nPoor creature fainted and cried Meelia murther, \nCalled for her brothers and gathered them all. \nCarmody swore that hed go no further \nTil he had satisfaction at Lanigans Ball. \nIn the midst of the row miss Kerrigan fainted, \nHer cheeks at the same time as red as a rose. \nSome of the lads declared she was painted, \nShe took a small drop too much, I suppose. \nHer sweetheart, Ned Morgan, so powerful and able, \nWhen he saw his fair colleen stretched out by the wall, \nTore the left leg from under the table \nAnd smashed all the Chaneys at Lanigans Ball. \nBoys, oh boys, twas then there were runctions. \nMyself got a lick from big Phelim McHugh. \nI soon replied to his introduction \nAnd kicked up a terrible hullabaloo. \nOld Casey, the piper, was near being strangled. \nThey squeezed up his pipes, bellows, chanters and all. \nThe girls, in their ribbons, they got all entangled \nAnd that put an end to Lanigans Ball."
data_mal = "രാത്രിമഴ,ചുമ്മാതെ \nകേണും ചിരിച്ചും \nവിതുമ്പിയും നിര്‍ത്താതെ \nപിറുപിറുത്തും നീണ്ട \nമുടിയിട്ടുലച്ചും \nകുനിഞ്ഞിരിക്കുന്നോരു \nയുവതിയാം ഭ്രാന്തിയെപ്പോലെ. \nരാത്രിമഴ,മന്ദമീ- \nയാശുപത്രിക്കുള്ളി-\nലൊരുനീണ്ട തേങ്ങലാ-\nയൊഴുകിവന്നെത്തിയീ-nക്കിളിവാതില്‍വിടവിലൂ-\nടേറേത്തണുത്തകൈ-\nവിരല്‍ നീട്ടിയെന്നെ –\nതൊടുന്നൊരീ ശ്യാമയാം\nഇരവിന്‍റെ ഖിന്നയാം പുത്രി.\nരാത്രിമഴ,നോവിന്‍\nഞരക്കങ്ങള്‍ ഞെട്ടലുകള്‍,\n തീക്ഷ്ണസ്വരങ്ങള്‍\nപൊടുന്നനെയൊരമ്മതന്‍\nആര്‍ത്തനാദം!………ഞാന്‍\nനടുങ്ങിയെന്‍ ചെവിപൊത്തി-\nയെന്‍ രോഗശയ്യയി-\nലുരുണ്ടു തേങ്ങുമ്പൊഴീ-\nയന്ധകാരത്തിലൂ-\nടാശ്വാസ വാക്കുമാ-\nയെത്തുന്ന പ്രിയജനം പോലെ.\nആരോ പറഞ്ഞു\nമുറിച്ചു മാറ്റാം കേടു-\nബാധിച്ചോരവയവം;\nപക്ഷെ,കൊടും കേടുബാധിച്ച പാവം മനസ്സോ?\nരാത്രിമഴ,പണ്ടെന്‍റെ\nസൗഭാഗ്യരാത്രികളി-\nലെന്നെച്ചിരിപ്പിച്ച\nകുളിര്‍കോരിയണിയിച്ച,\nവെണ്ണിലാവേക്കാള്‍\nപ്രിയംതന്നുറക്കിയോ-\nരന്നത്തെയെന്‍ പ്രേമസാക്ഷി.\nരാത്രിമഴ,-ഇന്നെന്‍റെ\nരോഗോഷ്ണശയ്യയില്‍,\nവിനിദ്രയാമങ്ങളി-\nലിരുട്ടില്‍ തനിച്ചു കര-\nയാനും മറന്നു ഞാ-\nനുഴലവേ,ശിലപോലെ-\nയുറയവേ ദുഃഖസാക്ഷി.\nരാത്രിമഴയോടു ഞാന്‍\nപറയട്ടെ,നിന്‍റെ\nശോകാര്‍ദ്രമാം സംഗീത-\nമറിയുന്നു ഞാന്‍;നിന്‍റെ-\nയലിവും അമര്‍ത്തുന്ന\nരോഷവും,ഇരുട്ടത്തു\nവരവും,തനിച്ചുള്ള\nതേങ്ങിക്കരച്ചിലും\nപുലരിയെത്തുമ്പോള്‍\nമുഖം തുടച്ചുള്ള നിന്‍\nചിരിയും തിടുക്കവും\nനാട്യവും ഞാനറിയും;\nഅറിയുന്നതെന്തുകൊ-\nണ്ടെന്നോ?സഖീ,ഞാനു-\nമിതുപോലെ, രാത്രിമഴപോലെ."
data_mal_cleaned = "രാത്രിമഴ,ചുമ്മാതെ \nകേണും ചിരിച്ചും \nവിതുമ്പിയും നിര്‍ത്താതെ \nപിറുപിറുത്തും നീണ്ട \nമുടിയിട്ടുലച്ചും \nകുനിഞ്ഞിരിക്കുന്നോരു \nയുവതിയാം ഭ്രാന്തിയെപ്പോലെ. \nരാത്രിമഴ,മന്ദമീയാശുപത്രിക്കുള്ളിലൊരു \nനീണ്ട തേങ്ങലായൊഴുകിവന്നെത്തിയീ \n കിളിവാതില്‍ വിടവിലൂടേറേത്തണുത്തകൈവിരല്‍ \nനീട്ടിയെന്നെതൊടുന്നൊരീ ശ്യാമയാം\nഇരവിന്‍റെ ഖിന്നയാം പുത്രി.\nരാത്രിമഴ,നോവിന്‍\nഞരക്കങ്ങള്‍ ഞെട്ടലുകള്‍,\n തീക്ഷ്ണസ്വരങ്ങള്‍\nപൊടുന്നനെയൊരമ്മതന്‍\nആര്‍ത്തനാദം!……… ഞാന്‍\nനടുങ്ങിയെന്‍ ചെവിപൊത്തിയെന്‍ \n രോഗശയ്യയിലുരുണ്ടു തേങ്ങുമ്പൊഴീയന്ധകാരത്തിലൂടാശ്വാസ \n വാക്കുമായെത്തുന്ന പ്രിയജനം പോലെ.\nആരോ പറഞ്ഞു\nമുറിച്ചു മാറ്റാം \nകേടുബാധിച്ചോരവയവം;\nപക്ഷെ,കൊടും\nകേടുബാധിച്ച പാവം മനസ്സോ?\nരാത്രിമഴ,പണ്ടെന്‍റെ\nസൗഭാഗ്യരാത്രികളിലെന്നെച്ചിരിപ്പിച്ച\nകുളിര്‍കോരിയണിയിച്ച,\nവെണ്ണിലാവേക്കാള്‍\nപ്രിയംതന്നുറക്കിയോരന്നത്തെയെന്‍ പ്രേമസാക്ഷി.\nരാത്രിമഴ, ഇന്നെന്‍റെ\nരോഗോഷ്ണശയ്യയില്‍,\nവിനിദ്രയാമങ്ങളിലിരുട്ടില്‍ തനിച്ചു  \nകരയാനും മറന്നു ഞാനുഴലവേ, \nശിലപോലെയുറയവേ ദുഃഖസാക്ഷി.\nരാത്രിമഴയോടു ഞാന്‍\nപറയട്ടെ,നിന്‍റെ\nശോകാര്‍ദ്രമാം സംഗീതമറിയുന്നു ഞാന്‍; \n നിന്‍റെയലിവും അമര്‍ത്തുന്ന\nരോഷവും,ഇരുട്ടത്തു\nവരവും, തനിച്ചുള്ള\nതേങ്ങിക്കരച്ചിലും\nപുലരിയെത്തുമ്പോള്‍\nമുഖം തുടച്ചുള്ള നിന്‍\nചിരിയും തിടുക്കവും\nനാട്യവും ഞാനറിയും;\nഅറിയുന്നതെന്തുകൊണ്ടെന്നോ?  \nസഖീ,ഞാനുമിതുപോലെ, രാത്രിമഴപോലെ."
oru_paatu = "ഒരു പാട്ടു പിന്നെയും പാടി നോക്കുന്നിതാ \nചിറകൊടിഞ്ഞുള്ളോരീ കാട്ടുപക്ഷിമഴുതിന്ന\n മാമര കൊമ്പില്‍ തനിച്ചിരുന്നൊ-\nടിയാ ചിറകു ചെറുതിളക്കി\nനോവുമെന്നോര്‍ത്തു പതുക്കെ അനങ്ങാതെ\nപാവം പണിപ്പെട്ടു പാടിടുന്നു\nഇടരുമീ ഗാനമോന്നേറ്റു പാടാന്‍ കൂടെ\nഇണയില്ല കൂട്ടിനു കിളികളില്ല\nപതിവുപോല്‍ കൊത്തി പിരിഞ്ഞുപോയ്‌\nമേയ്‌ ചൂടില്‍ അടവെച്ചുയര്‍ത്തിയ കൊച്ചുമക്കള്‍\nആര്‍ക്കുമല്ലാതെ വെളിച്ചവും ഗാനവും\nകാറ്റും മനസ്സില്‍ കുടിയിരുത്തി\nവരവായോരന്തിയെ കണ്ണാല്‍ ഉഴിഞ്ഞു –\nകൊണ്ടൊരു കൊച്ചു രാപ്പൂവുണര്‍ന്ന നേരം\nഒരു പാട്ടു കൂടി പതുക്കെ മൂളുന്നിതാ\nചിറകൊടിഞ്ഞുള്ളോരീ കാട്ടുപക്ഷി\nഇരുളില്‍ തിളങ്ങുമീ പാട്ടു കേള്‍ക്കാന്‍ കൂടെ\nമരമുണ്ട് മഴയുണ്ട് കുളിരുമുണ്ട്\nനിഴലുണ്ട് പുഴയുണ്ട് തലയാട്ടുവാന്‍ താഴെ\nവഴിമര ചോട്ടിലെ പുല്ലുമുണ്ട്\nആരുമില്ലെങ്കിലെന്തായിരം കൊമ്പത്ത്\nതാരുകളുണ്ട് താരങ്ങളുണ്ട്\nആപാട്ടിലാഹ്ലാദ തേനുണ്ട് കനിവെഴും\nസ്വപ്നങ്ങളുണ്ട് കണ്ണീരുമുണ്ട്\nഒരു പാട്ടു പിന്നെയും പാടവേ തന്‍ കൊച്ചു\nചിറകിന്റെ നോവ്‌ മറന്നു പോകെ\nഇനിയും പറക്കില്ല എന്നതോര്‍ക്കാതെയാ\nവിരിമാനം ഉള്ളാല്‍ പുണര്‍ന്നു കൊണ്ടേ\nവെട്ടിയ കുറ്റിമേല്‍ ചാഞ്ഞിരുന്നാര്‍ദ്രമായ്‌\nഒറ്റചിറകിന്റെ താളമോടെ\nഒരുപാട്ട് വീണ്ടും തെളിഞ്ഞു പാടുന്നിതാ\nചിറകൊടിഞ്ഞുള്ളോരീ കാട്ടുപക്ഷി."
oru_paatu_cleaned = "ഒരു പാട്ടു പിന്നെയും പാടി നോക്കുന്നിതാ \nചിറകൊടിഞ്ഞുള്ളോരീ കാട്ടുപക്ഷിമഴുതിന്ന\n മാമര കൊമ്പില്‍ തനിച്ചിരുന്നൊടിയാ \nചിറകു ചെറുതിളക്കി\nനോവുമെന്നോര്‍ത്തു പതുക്കെ അനങ്ങാതെ\nപാവം പണിപ്പെട്ടു പാടിടുന്നു\nഇടരുമീ ഗാനമോന്നേറ്റു പാടാന്‍ കൂടെ\nഇണയില്ല കൂട്ടിനു കിളികളില്ല\nപതിവുപോല്‍ കൊത്തി പിരിഞ്ഞുപോയ്‌\nമേയ്‌ ചൂടില്‍ അടവെച്ചുയര്‍ത്തിയ കൊച്ചുമക്കള്‍\nആര്‍ക്കുമല്ലാതെ വെളിച്ചവും ഗാനവും\nകാറ്റും മനസ്സില്‍ കുടിയിരുത്തി\nവരവായോരന്തിയെ കണ്ണാല്‍ ഉഴിഞ്ഞു \nകൊണ്ടൊരു കൊച്ചു രാപ്പൂവുണര്‍ന്ന നേരം\nഒരു പാട്ടു കൂടി പതുക്കെ മൂളുന്നിതാ\nചിറകൊടിഞ്ഞുള്ളോരീ കാട്ടുപക്ഷി\nഇരുളില്‍ തിളങ്ങുമീ പാട്ടു കേള്‍ക്കാന്‍ കൂടെ\nമരമുണ്ട് മഴയുണ്ട് കുളിരുമുണ്ട്\nനിഴലുണ്ട് പുഴയുണ്ട് തലയാട്ടുവാന്‍ താഴെ\nവഴിമര ചോട്ടിലെ പുല്ലുമുണ്ട്\nആരുമില്ലെങ്കിലെന്തായിരം കൊമ്പത്ത്\nതാരുകളുണ്ട് താരങ്ങളുണ്ട്\nആപാട്ടിലാഹ്ലാദ തേനുണ്ട് കനിവെഴും\nസ്വപ്നങ്ങളുണ്ട് കണ്ണീരുമുണ്ട്\nഒരു പാട്ടു പിന്നെയും പാടവേ തന്‍ കൊച്ചു\nചിറകിന്റെ നോവ്‌ മറന്നു പോകെ\nഇനിയും പറക്കില്ല എന്നതോര്‍ക്കാതെയാ\nവിരിമാനം ഉള്ളാല്‍ പുണര്‍ന്നു കൊണ്ടേ\nവെട്ടിയ കുറ്റിമേല്‍ ചാഞ്ഞിരുന്നാര്‍ദ്രമായ്‌\nഒറ്റചിറകിന്റെ താളമോടെ\nഒരുപാട്ട് വീണ്ടും തെളിഞ്ഞു പാടുന്നിതാ\nചിറകൊടിഞ്ഞുള്ളോരീ കാട്ടുപക്ഷി."
renuka = "രേണുകേ നീ രാഗരേണു കിനാവിന്റെ\nനീലകടമ്പിന്‍ പരാഗരേണു\nപിരിയുമ്പോഴേതോ നനഞ്ഞകൊമ്പില്‍ നിന്നു\nനിലതെറ്റി വീണ രണ്ടിലകള്‍ നമ്മള്‍\nരേണുകേ നാം രണ്ടു മേഘശകലങ്ങളായ്\nഅകലേക്കുമറയുന്ന ക്ഷണഭംഗികള്‍\nമഴവില്ലു താഴെ വീണുടയുന്ന മാനത്ത്\nവിരഹ മേഘ ശ്യാമ ഘനഭംഗികള്‍\nപിരിയുന്നു രേണുകേ നാം രണ്ടുപുഴകളായ്\nഒഴുകി അകലുന്നു നാം പ്രണയശൂന്യം\nജലമുറഞ്ഞൊരു ദീര്‍ഘ ശിലപോലെ നീ,\nവറ്റി വറുതിയായ് ജീര്‍ണ്ണമായ് മൃതമായിഞാന്‍\nഓര്‍മ്മിക്കുവാന്‍ ഞാന്‍ നിനക്കെന്തു നല്‌കണം\nഓര്‍മ്മിക്കണം എന്ന വാക്കു മാത്രം\nഎന്നങ്കിലും വീണ്ടും എവിടെ വച്ചെങ്കിലും\nകണ്ടുമുട്ടാമന്ന വാക്കുമാത്രം\nനാളെ പ്രതീക്ഷതന്‍ കുങ്കുമപൂവായി\nനാം കടംകൊള്ളുന്നതിത്രമാത്രം\nരേണുകേ നാം രണ്ടു നിഴലുകള്‍\nഇരുളില്‍ നാം രൂപങ്ങളില്ലാ കിനാവുകള്‍\nപകലിന്റെ നിറമാണു നമ്മളില്‍\nനിനവും നിരാശയും\nകണ്ടുമുട്ടുന്നു നാം വീണ്ടുമീ സന്ധ്യയില്‍\nവര്‍ണ്ണങ്ങള്‍ വറ്റുന്ന കണ്ണുമായി\nനിറയുന്നു നീ എന്നില്‍ നിന്റെ കണ്മുനകളില്‍\nനിറയുന്ന കണ്ണുനീര്‍ തുള്ളിപോലെ\nഭ്രമമാണുപ്രണയം വെറും ഭ്രമം\nവാക്കിന്റെ വിരുതിനാല്‍ തീര്‍ക്കുന്ന സ്പടിക സൗധം\nഎപ്പോഴൊ തട്ടി തകര്‍ന്നുവീഴുന്നു നാം\nനഷ്‌ടങ്ങളറിയാതെ നഷ്‌ടപ്പെടുന്നു നാം\nസന്ധ്യയും മാഞ്ഞു നിഴല്‍ മങ്ങി നോവിന്റെ\nമൂകാന്ധകാരം കനക്കുന്ന രാവതില്‍\nമുന്നില്‍ രൂപങ്ങളില്ലാ കനങ്ങളായ്\nനമ്മള്‍ നിന്നു നിശബ്‌ദ ശബ്‌ദങ്ങളായ്\nപകലുവറ്റി കടന്നുപോയ് കാലവും\nപ്രണയമുറ്റിച്ചിരിപ്പു രൗദ്രങ്ങളും\nപുറകിലാരോ വിളിച്ചതായ് തോന്നിയോ\nപ്രണയമരുതന്നുരഞ്ഞതായ് തോന്നിയോദുരിത\n മോഹങ്ങള്‍ക്കുമുകളില്‍ നിന്നൊറ്റക്ക്\nചിതറി വീഴുന്നതിന്‍ മുമ്പല്പമാത്രയില്‍\nക്ഷണികമായെങ്കിലും നാം കണ്ട കനവിന്റെ\nമധുരം മിഴിപ്പൂ നനച്ചുവോ രേണുകേ…\nരേണുകേ നീ രാഗരേണു കിനാവിന്റെ\nനീലകടമ്പിന്‍ പരാഗരേണു\nപിരിയുമ്പോഴേതോ നനഞ്ഞകൊമ്പില്‍ നിന്നു\nനിലതെറ്റി വീണ രണ്ടിലകള്‍ നമ്മള്‍ "
krishna_nee_ariyumo_enne = "ഇവിടെയമ്പാടിതന്‍ ഒരു കോണിലരിയ\nമൺകുടിലില്‍ ഞാന്‍ മേവുമൊരു പാവം\nകൃഷ്ണാ നീയെന്നെയറിയില്ല\nഇവിടെയമ്പാടി തന്‍ ഒരു കോണിലരിയ\nമൺകുടിലില്‍ ഞാന്‍ മേവുമൊരു പാവം\nകൃഷ്ണാ നീയെന്നെയറിയില്ല\nശബളമാം പാവാട ഞൊറികള്‍ ചുഴലുന്ന\nകാൽത്തളകള്‍ കള ശിജ്ഞിതം പെയ്കെ\nഅരയില്‍ തിളങ്ങുന്ന കുടവുമായ്‌ മിഴികളില്‍\nഅനുരാഗമഞ്ചനം ചാര്‍ത്തി\nജലമെടുക്കാനെന്ന മട്ടില്‍ ഞാന്‍ തിരുമുന്‍പില്‍\nഒരു നാളുമെത്തിയിട്ടില്ല\nകൃഷ്ണാ നീയെന്നെയറിയില്ല\nചപലകാളിന്ദി തന്‍ കുളിരലകളില്‍\nപാതി മുഴുകി നാണിച്ചു മിഴി കൂമ്പി\nവിറ പൂണ്ട കൈ നീട്ടി നിന്നോട്\nഞാനെന്‍റെ ഉടയാട വാങ്ങിയിട്ടില്ല\nകൃഷ്ണാ നീയെന്നെയറിയില്ല\nകാടിന്റെ ഹൃത്തില്‍ കടമ്പിന്റെ ചോട്ടില്‍\nനീ ഓടക്കുഴല്‍ വിളിക്കുമ്പോള്‍\nഅണിയല്‍ മുഴുമിക്കാതെ പൊങ്ങിത്തിളച്ചു\nപാല്‍ ഒഴുകി മറിയുന്നതോര്‍ക്കാതെ\nവിടുവേല തീര്‍ക്കാതെ ഉടുചേല കിഴിവതും\nമുടിയഴിവതും കണ്ടിടാതെ\nകരയുന്ന പൈതലേ പുരികം ചുളിക്കുന്ന\nകണവനെ കണ്ണിലറിയാതെ\nഎല്ലാം മറന്നോടിയെത്തിയിട്ടില്ല ഞാന്‍\nവല്ലവികളൊത്തു നിന്‍ ചാരേ\nകൃഷ്ണാ നീയെന്നെയറിയില്ല\nഅവരുടെ ചിലമ്പൊച്ചയകലെ മാഞ്ഞീടവേ\nമിഴി താഴ്ത്തി ഞാന്‍ തിരികെ വന്നു\nഎന്‍റെ ചെറു കുടിലില്‍ നൂറായിരം പണികളില്‍\nഎന്‍റെ ജന്മം ഞാന്‍ തളച്ചു\nകൃഷ്ണാ നീയെന്നെയറിയില്ല\nനീ നീല ചന്ദ്രനായ്‌ നടുവില്‍ നില്‍ക്കെ\nചുറ്റുമാലോലമാലോലമിളകി\nആടിയുലയും ഗോപസുന്ദരികള്‍തന്‍\nലാസ്യമോടികളുലാവി ഒഴുകുമ്പോള്‍\nകുസൃതി നിറയും നിന്‍റെ കുഴല്‍ വിളിയുടന്‍\nമദദ്രുതതാളമാര്‍ന്നു മുറുകുമ്പോള്‍\nകിലുകിലെ ചിരി പൊട്ടിയുണരുന്ന കാല്‍ത്തളകള്‍\nകലഹമൊടിടഞ്ഞു ചിതറുമ്പോള്‍\nതുകില്‍ ഞൊറികള്‍ പൊന്‍മെയ്കള്‍\nതരിവളയണിക്കൈകള്‍ മഴവില്ലു ചൂഴെ വീശുമ്പോള്‍\nഅവിടെ ഞാന്‍ മുടിയഴിഞ്ഞണിമലര്‍ക്കുല\nപൊഴിഞ്ഞോരുനാളുമാടിയിട്ടില്ല\nകൃഷ്ണാ നീയെന്നെയറിയില്ല\nനടനമാടിത്തളര്‍ന്നംഗങ്ങള്‍\nതൂവേര്‍പ്പ് പൊടിയവേ\nപൂമരം ചാരിയിളകുന്ന മാറിൽ\nകിതപ്പോടെ നിന്‍ മുഖം\nകൊതിയാര്‍ന്നു നോക്കിയിട്ടില്ല\nകൃഷ്ണാ നീയെന്നെയറിയില്ല\nനിപുണയാം തോഴിവന്നെൻ\nപ്രേമദുഃഖങ്ങളവിടുത്തൊടോതിയിട്ടില്ല\nതരളവിപിനത്തില്ലതാനികുഞ്ചത്തില്‍\nവെണ്മലരുകള്‍ മദിച്ചു വിടരുമ്പോള്‍\nഅകലെ നിന്‍ കാലൊച്ച കേള്‍ക്കുവാന്‍\nകാതോര്‍ത്തു ചകിതയായ്‌ വാണിട്ടുമില്ല\nകൃഷ്ണാ നീയെന്നെയറിയില്ല\nഒരു നൂറുനൂറു വനകുസുമങ്ങള്‍ തന്‍ ധവള\nലഹരിയൊഴുകും കുളിര്‍നിലാവില്‍n\nഒരു നാളുമാ നീല വിരിമാറില്‍\nഞാനെന്‍റെ തല ചായ്ച്ചു നിന്നിട്ടുമില്ലാ\nകൃഷ്ണാ നീയെന്നെയറിയില്ല\nപോരു വസന്തമായ്‌ പോരു വസന്തമായ്‌\nനിന്‍റെ കുഴല്‍ പോരു വസന്തമായ്‌\nഎന്നെന്റെയന്തരംഗത്തിലല ചേര്‍ക്കേ\nഞാനെന്‍റെ പാഴ്ക്കുടിലടച്ചു\nതഴുതിട്ടിരുന്നാനന്ദബാഷ്പം പൊഴിച്ചു\nആരോരുമറിയാതെ നിന്നെയെന്നുള്ളില്‍വ\nച്ചാത്മാവ് കൂടിയര്‍ചിച്ചു\nകൃഷ്ണാ നീയെന്നെയറിയില്ല\nകരയുന്നു ഗോകുലം മുഴുവനും\nകരയുന്നു ഗോകുലം മുഴുവനും\nകൃഷ്ണ നീ മഥുരയ്ക്കു പോകുന്നുവത്രെ\nപുല്‍ത്തേരുമായ്‌ നിന്നെയാനയിക്കാന്‍\nക്രൂരനക്രൂരനെത്തിയിങ്ങത്രേ\nഒന്നുമേ മിണ്ടാതനങ്ങാതെ ഞാന്‍\nഎന്‍റെ ഉമ്മറത്തിണ്ണയിലിരിക്കെ\nരഥചക്രഘോഷം കുളമ്പൊച്ച\nരഥചക്രഘോഷം കുളമ്പൊച്ച\nഞാനെന്‍റെ മിഴി പൊക്കി നോക്കിടും നേരം\nനൃപചിഹ്നമാര്‍ന്ന കൊടിയാടുന്ന\nതേരില്‍ നീ നിറതിങ്കള്‍ പോല്‍ വിളങ്ങുന്നു\nകരയുന്നു കൈ നീട്ടി ഗോപിമാർ\nകേണു നിന്‍ പിറകെ കുതിക്കുന്നു പൈക്കള്‍\nതിരുമിഴികള്‍ രണ്ടും കലങ്ങി ചുവന്നു നീ\nഅവരെ തിരിഞ്ഞു നോക്കുന്നു\nഒരു ശിലാബിംബമായ്‌ മാറി ഞാന്‍\nമിണ്ടാതെ കരയാതനങ്ങാതിരിക്കെ\nഅറിയില്ല എന്നെ നീ എങ്കിലും കൃഷ്ണ\nനിന്‍ രഥമെന്റെ കുടിലിനു മുന്നില്‍\nഒരു മാത്ര നില്‍ക്കുന്നു\nകണ്ണീര്‍ നിറഞ്ഞൊരാ\nമിഴികളെന്‍ നേര്‍ക്കു ചായുന്നു\nകരുണയാലാകെ തളര്‍ന്നൊരാ\nദിവ്യമാം സ്മിതമെനിക്കായി നല്‍കുന്നു\nകൃഷ്ണാ നീയറിയുമോ എന്നെ\nകൃഷ്ണാ നീയറിയുമോ\nഎന്നെനീയറിയുമോ എന്നെ."

kadha_jalakam_1 = "എന്റെ ഗണേശാ, നാളെയാണ് റിസൽട്ട് വരുന്നത്. എല്ലാം നന്നായി എഴുതിയിട്ടുണ്ട് എങ്കിലും നീ കുസൃതിയൊന്നും കാട്ടാതെ എന്നെ നല്ല മാർക്കോടെ പാസ്സാക്കണേ.ഗൗരി തന്റെ ഉണ്ണി ഗണപതിയുടെ വിഗ്രഹത്തിന് മുന്നിൽ ചെന്നു നിന്നു കൈകൂപ്പി. അവളുടെ പ്രാർത്ഥന കേട്ടാൽ തോന്നും ഗണേശനാണ് പരീക്ഷ പേപ്പർ നോക്കുന്നതെന്നു. ഭാനു അവളെ കളിയാക്കി. അമ്മയൊന്നു മിണ്ടതിരുന്നേ. താൻ പാതി ദൈവം പാതി എന്നാ. എന്റെ പാതി ഞാൻ എഴുതി. പുള്ളിക്കാരന്റെ പാതി മറക്കണ്ടാന്ന് കരുതി ഒന്ന് ഓർമ്മിപ്പിച്ചതാ.ഗൗരി ഗണേശനെ നോക്കി കണ്ണിറുക്കിയിട്ടു പുറത്തേക്കോടി.പാവം.ഇങ്ങനൊരു പൊട്ടിപ്പെണ്ണു. ഭാനു അവളുടെ ഓട്ടം കണ്ടു പുഞ്ചിരിച്ചു. ആനയോട് തോന്നിയ കൗതുകമാണ് ആനയുടെ മുഖമുള്ള ഗണേശനിലേക്ക് അവളെ അടുപ്പിച്ചത്. ഇപ്പോൾ അവൾക്കെല്ലാം അവളുടെയീ ഉണ്ണി ഗണപതിയാണ്. ഭാനു ഓർത്തു.ഭാനു. ദിവാകരന്റെ വിളികേട്ട് ഭാനു ഉമ്മറത്തേക്ക് ചെന്നു.ഹാ വന്നോ. എന്തായി പോയ കാര്യം. ഭാനു ഭർത്താവിന്റെ കൈയ്യിൽ നിന്നും കുട വാങ്ങിക്കൊണ്ടു ചോദിച്ചു.പറയാം. നീയൊരു ഗ്ലാസ്സ് ചൂടുവെള്ളം എടുക്ക്. എന്നിട്ട് അമ്മയെ കൂടെ വിളിയ്ക്ക്. ഗൗരി എവിടെ. ദിവാകരൻ ഷർട്ടും ഊരിക്കൊണ്ട് അകത്തേക്ക് കയറി.അവള് അപ്പുറത്തെ പിള്ളാരുടെ കൂടെ കാണും. ഭാനു അടുക്കളയിലേക്ക് പോയി.എന്താ മോനെ ജ്യോത്സ്യൻ എന്ത് പറഞ്ഞു. സൗദാമിനിയമ്മ ദിവാകരന്റെ അടുത്തായി കട്ടിലിൽ ചെന്ന് ഇരുന്നു.അയാൾ ഭാനു കൊടുത്ത വെള്ളം ഒറ്റവലിയ്ക്ക് കുടിച്ചിട്ട് ഗ്ലാസ്സ് അവരെ ഏൽപ്പിച്ചു. നീയാ വാതിലൊന്നടയ്‌ക്ക് ഭാനു. കുട്ടി കേൾക്കണ്ട. ദിവാകരൻ പറയാൻ പോകുന്നത് എന്തോ കാര്യമായ കാര്യമാണെന്ന് ഭാനുവിനും അമ്മയ്ക്കും മനസ്സിലായി. ഭാനു കതകും ചാരി അവർക്കടുത്തായി കസേരയിൽ വന്നിരുന്നു.നമ്മൾ ഇപ്പോൾ നോക്കിച്ചത് നന്നായി. ലക്ഷ്മി മോളുടെ ജാതകം നോക്കിച്ചപ്പോൾ എന്താ ജ്യോത്സ്യൻ പറഞ്ഞത്. നമ്മൾ വേണ്ടാന്നും പറഞ്ഞു തള്ളിക്കളയുന്ന ബന്ധമാകും അവൾക്ക് നടക്കാൻ പോകുന്നതെന്ന്. എന്നിട്ടെന്തായി? അയാൾ പറഞ്ഞതു പോലെ തന്നെ സംഭവിച്ചില്ലേ? ശരത്തിന്റെ ആലോചന വേണ്ട എന്നും കരുതി ഇരുന്നതല്ലേ നമ്മൾ. എന്നിട്ട് അവരിപ്പോൾ സന്തോഷത്തോടെ ജീവിക്കുന്നില്ലേ. ഇരുപതു വയസ്സിൽ കല്യാണം നടക്കും എന്നു പറഞ്ഞതും സത്യമായില്ലേ. ദിവാകരൻ മൂത്ത മകൾ ലക്ഷ്മിയുടെ കാര്യം പറഞ്ഞ് ഒരു തുടക്കമിട്ടു.ഇതൊക്കെ നമുക്ക് അറിയാവുന്ന കാര്യമല്ലേ. നീയിങ്ങനെ വളച്ചു കെട്ടാതെ ജ്യോത്സ്യൻ എന്താ പറഞ്ഞതെന്ന് പറ.സൗദാമിനിയമ്മ ദിവാകരനോട് പറഞ്ഞു.അത്വേറൊന്നുമല്ലമ്മേ.ഗൗരിയ്ക്ക് രണ്ടു മാസത്തിനുള്ളിൽ വിവാഹം നടക്കണം.ഇല്ലെങ്കിൽ ഇരുപത്തി മൂന്നു കഴിയും.പക്ഷെ അന്ന് നമ്മൾ വിചാരിച്ചതുപോലെ ഒരു നല്ല ബന്ധം കിട്ടണമെന്നില്ല. ദിവാകരൻ പറഞ്ഞതുകേട്ട് ഭാനുവിന്റെ കണ്ണുകൾ നിറഞ്ഞു. സൗദാമിനിയമ്മ നെഞ്ചത്തു കൈവെച്ചു.എന്താ ദിവാകരേട്ടൻ ഈ പറയുന്നത്. പ്ലസ് ടു പഠിയ്ക്കുന്ന പെണ്ണിനെ പിടിച്ചു കെട്ടിച്ചു വിടാനോ. നാളെ റിസൽട്ട് വരുന്നതും നോക്കിയിരിക്കുവാ അവൾ. ചേച്ചി പഠിച്ച കോളേജിൽ തന്നെ അഡ്‌മിഷൻ വാങ്ങണമെന്ന് ഇന്നലെയും കൂടി എന്നോട് പറഞ്ഞു. ഭാനു കരയുകയായിരുന്നു.വേണ്ട മോനെ. അല്പം വൈകിയാലും സാരമില്ല. ഒന്നുമറിയാത്ത കുഞ്ഞിനെ ഇപ്പോഴേ കെട്ടിച്ചു വിടുകാന്ന് വെച്ചാൽ. ഒന്നാമത് അവൾക്ക് പതിനെട്ടു വയസ്സായിട്ടില്ല. കുറച്ചൂടെ കഴിയട്ടെ. നമുക്ക് അവളുടെ ജാതകം വേറെ ആരെയെങ്കിലും കൊണ്ട് ഒന്നൂടെ നോക്കിക്കാം. സൗദാമിനിയമ്മയും താൽപ്പര്യം ഇല്ലാത്തതുപോലെ സംസാരിച്ചു.അതെല്ലാം ശെരിയാണ്. പക്ഷെ. ആ സമയത്തു വിവാഹം നടത്തുമ്പോൾ മോളുടെ ജാതകത്തിൽ വൈധവ്യ ദോഷം കാണുന്നുണ്ട്. ദിവാകരൻ പറഞ്ഞതു കേട്ട് ഭാനുവും സൗദാമിനിയും പരസ്പരം നോക്കി.മോൾക്ക് പറ്റിയ ജാതകക്കാരൻ വന്നാൽ അറിയിക്കാമെന്നു ജ്യോത്സ്യൻ പറഞ്ഞിട്ടുണ്ട്. ദിവാകരൻ അത്രയും പറഞ്ഞിട്ട് എഴുന്നേറ്റ് കതകു തുറന്നു പുറത്തേക്കിറങ്ങി. മുന്നിൽ നിറകണ്ണുകളോടെ നിൽക്കുന്ന ഗൗരിയെ കണ്ടപ്പോൾ അയാളുടെ ചങ്ക് പൊടിയും പോലെ തോന്നി. ഒന്നും മിണ്ടാതെ അവളുടെ തലയിലൊന്നു തഴുകി അയാൾ ഉമ്മറത്തേക്ക് പോയി. ഗൗരി മുറിയിൽ കയറുമ്പോൾ അമ്മയും അച്ഛമ്മയും കരയുകയായിരുന്നു. അവൾ അവരെയൊന്നു നോക്കിയിട്ട് ഒന്നും മിണ്ടാതെ തന്റെ മുറിയിലേക്ക് നടന്നു. പിറ്റേന്ന് രാവിലെ എഴുന്നേൽക്കാൻ മടിച്ചു മൂടിപ്പുതച്ചു കിടക്കുന്ന ഗൗരിയെ തട്ടി വിളിച്ചുകൊണ്ട് ഭാനു ആ സന്തോഷ വാർത്ത പറഞ്ഞു. തൊണ്ണൂറ്റി ആറു ശതമാനം മാർക്കോടെ അവൾ പ്ലസ്ടു പാസ്സായി. ഗൗരിയുടെ സന്തോഷത്തിനു അതിരുകളില്ലായിരുന്നു. അവൾ വിളക്കിനു മുന്നിൽ ചെന്നു നിന്നു കൈകൂപ്പി. അവളുടെ ഉണ്ണി ഗണപതിയുടെ തുമ്പിക്കയ്യിൽ ഒരുമ്മ കൊടുത്തു. പൊടുന്നനെ അവളുടെ മുഖം വാടി. കണ്ണുകൾ നിറഞ്ഞു. ഗണേശാ. വിഘ്‌നേശ്വരനല്ലേ നീ. എന്റെ കാര്യങ്ങൾക്കൊന്നും ഇന്നുവരെ ഒരു മുടക്കവും വരുത്തിയിട്ടില്ല നീ. എന്നാൽ അച്ഛനിന്നലെ പറഞ്ഞ കാര്യം. അതു മാത്രം കുറച്ചു നാളത്തേക്ക് നീട്ടിക്കൊണ്ട് പോകാൻ പറ്റുമോ. എനിയ്ക്ക് പഠിയ്ക്കണം. നല്ലൊരു ജോലി വാങ്ങണം. കുറച്ചു നാളെങ്കിലും അച്ഛനും അമ്മയ്ക്കും ചിലവിനു കൊടുക്കണം. സ്വന്തം കാലിൽ നിൽക്കണം. അത്രമാത്രമേ ഞാൻ ആഗ്രഹിയ്ക്കുന്നുള്ളൂ. കൂടെ നിൽക്കണേ. അവൾ നിറഞ്ഞ മിഴികൾ ധാവണി തുമ്പുകൊണ്ട് തുടച്ചിട്ട് മുറിയിലേക്ക് പോയി. ദിവസങ്ങൾ കടന്നു പൊയ്ക്കൊണ്ടിരുന്നു. ഗൗരിയുടെ വീട്ടിൽ ദിനംപ്രതി നിശബ്ദത കൂടിവന്നു.ഒരു ദിവസം രാവിലെ അഡ്മിഷന്റെ കാര്യത്തിന് പോകാനായി ഗൗരി ഒരുങ്ങുമ്പോൾ അച്ഛൻ പറയുന്നത് കേട്ടു ജ്യോത്സ്യൻ വിളിച്ചെന്ന്. അവിടെക്കൊന്നു ചെല്ലാൻ പറഞ്ഞു പോലും. തനിയ്ക്കുള്ള കുരുക്കാണാതെന്നു ഗൗരിയ്ക്ക് മനസ്സിലായി. അവളതു കാര്യമാക്കിയില്ല.അച്ഛനൊപ്പം അമ്മയും പോയെന്നു അച്ഛമ്മ പറഞ്ഞപ്പോൾ നെഞ്ചിലൊരു വിങ്ങൽ പോലെ തോന്നി ഗൗരി തന്റെ ഗണേശനെ നോക്കി. പുള്ളിക്കാരന്റെ മുഖത്തെ സന്തോഷം കണ്ടപ്പോൾ അവൾക്ക് ദേഷ്യം വന്നു.മോളിത്‌ എവിടെയായിരുന്നു. എത്ര നേരംകൊണ്ട് അച്ഛൻ തിരക്കുന്നെന്നറിയുമോ. വീട്ടിലേക്ക് തിരിച്ചു വന്നയുടനെ ഭാനു ഗൗരിയോട് ചോദിച്ചു.ഞാനൊന്നു വായനശാല വരെ പോയതാ അമ്മേ. കോളേജുകളിലേക്കുള്ള അപേക്ഷകൾ ഇടേണ്ട നേരമാകുന്നു. അത് ഡൗണ്ലോഡ് ചെയ്യാൻ പോയതാണ്. പ്രിന്റടുക്കാൻ നോക്കിയപ്പോൾ പറ്റുന്നില്ല. എന്തോ എറർ കാണിച്ചു. പിന്നെ അതൊക്കെ ശെരിയാക്കി വന്നപ്പോഴേക്കും വൈകി. വായനശാലയിൽ നല്ല തിരക്കും ഉണ്ടായിരുന്നു ഇന്ന്. പ്ലസ് വണ്ണിലേക്കുള്ള അഡ്‌മിഷൻ തുടങ്ങി. അതിന്റെ തിരക്ക്. ഗൗരി തോളിൽ കിടന്ന ബാഗൂരി അമ്മയുടെ കൈയ്യിൽ കൊടുത്തിട്ട് സോഫയിലിരുന്ന അച്ഛമ്മയുടെ മടിയിൽ തലവെച്ചു കിടന്നു.ഭാനു ബാഗ് കൊണ്ട് അവളുടെ മുറിയിൽ വെച്ചിട്ട് അവൾക്ക് കുടിയ്ക്കാൻ നാരങ്ങാവെള്ളം കൊണ്ട് കൊടുത്തു. അതു വാങ്ങി ഒറ്റവലിയ്ക്ക് കുടിച്ചുകൊണ്ട് അവൾ വീണ്ടും അച്ഛമ്മയുടെ മടിയിൽ കിടന്നു.അമ്മയ്ക്ക് എന്തെങ്കിലും പറയാനുണ്ടോ. ഭാനുവിന്റെ നില്പും ഭാവവും കണ്ടപ്പോൾ ഗൗരി ചോദിച്ചു. അത്. മോളെ. ഞങ്ങളിന്നു ജ്യോത്സ്യൻ വിളിച്ചിട്ട് അയാളെ കാണാൻ പോയിരുന്നു. മോൾക്ക് ചേരുന്ന ഒരു ജാതകം വന്നിട്ടുണ്ട് അയാളുടെ കൈയ്യിൽ. ആ പയ്യനും ജാതകത്തിൽ എന്തോ പ്രശ്നം. ഇപ്പോൾ നടന്നില്ലെങ്കിൽ ഒരുപാട് താമസിക്കുമെന്ന്. ഇരുപത്തിമൂന്ന് വയസ്സേയുള്ളൂ. അമ്മ ഫോട്ടോ കണ്ടു. നല്ല പയ്യനാണ്. അവിടെ വെച്ചു തന്നെ ഞങ്ങൾ അവരുമായി ഫോണിലൂടെ സംസാരിച്ചു. നാളെ ഞായറാഴ്ച അല്ലെ. അവരൊന്നു വരും ഇങ്ങോട്ട്. മോളെയൊന്നു കാണാൻ. പേരിനൊരു ചടങ്ങു നടത്താനാണ് അവർക്കും താല്പര്യം. മോളെ അവര് തുടർന്ന് പടിപ്പിച്ചോളാo എന്നു പറയുന്നു. എന്റെമോള് എതിരോന്നും പറയാതെ സമ്മതിയ്ക്കണം.ഭാനു പറഞ്ഞത് കേട്ട് ഒന്നും മിണ്ടാതെ ഗൗരി എഴുന്നേറ്റ് മുറിയിലേക്ക് പോയി. പോകും വഴി തന്റെ ഉണ്ണി ഗണപതിയെ നോക്കിയപ്പോൾ പുള്ളിയും നിസ്സഹായതയോടെ അവളെ നോക്കുമ്പോലെ അവൾക്ക് തോന്നി. പിറ്റേന്ന് രാവിലെ വീട്ടിൽ തകൃതിയായി ഒരുക്കങ്ങൾ നടക്കുന്നതൊന്നും അവൾ കാര്യമാക്കിയില്ല. എതിർപ്പ് പ്രെകടിപ്പിച്ചിട്ടും കരഞ്ഞിട്ടും കാര്യമില്ല. അച്ഛനും അമ്മയും എല്ലാം തീരുമാനിച്ചു കഴിഞ്ഞു. ഇനി തന്റെ തലവര പോലെ നടക്കട്ടെ എന്നും കരുതി അവൾ ഗണേശന്റെ മുന്നിൽ നിർവികാരതയോടെ നിന്നു കൈകൾ കൂപ്പിയിട്ട് ക്ഷേത്രത്തിലേക്ക് നടന്നു. അവൾക്കിഷ്ടപ്പെട്ട നീലക്കളർ പട്ടുപാവാടയും ബ്ലൗസും ആയിരുന്നു വേഷം. മുടിയഴിച്ചിട്ടു അമ്മ കൊടുത്ത മുല്ലപ്പൂമാലയും ചൂടി. ചെറിയൊരു ജിമിക്കി കമ്മലും അണിഞ്ഞു . വാലിട്ടു കണ്ണുമെഴുതി പൊട്ടും തൊട്ടപ്പോൾ ഗൗരിയ്ക്ക് തന്നെ അവളോട് അസൂയ തോന്നി. ഓം ഗം ഗണപതയെ നമഃ. ഗണേശ മന്ത്രം ഉരുവിട്ടുകൊണ്ട് അവൾ സ്വർണ അങ്കി ചാർത്തിയ ഗണേശ വിഗ്രഹത്തിന് മുന്നിൽ കൈകൾ കൂപ്പി നിന്നു. ഗൗരിക്കുഞ്ഞിന്ന് വൈകിയോ. പ്രസാദം വാങ്ങാൻ കൈ നീട്ടിയപ്പോൾ ശാന്തിക്കാരൻ തിരുമേനി ചോദിച്ചു. ഞാൻ എഴുന്നേൽക്കാൻ വൈകി തിരുമേനി. ഗൗരി എന്തിനോ വേണ്ടിയൊരു നുണ പറഞ്ഞു. അദ്ദേഹം അവളെ നോക്കിയൊന്നു പുഞ്ചിരിച്ചിട്ടു ഗണേശന് നിവേദിച്ചതിൽ നിന്നും രണ്ട് ഉണ്ണിയപ്പം എടുത്ത് അവൾക്കു കൊടുത്തു. ഗൗരിയ്ക്കെന്തോ വല്ലാത്തൊരു സന്തോഷം തോന്നി. മനസ്സു പെട്ടെന്ന് ശാന്തമായത് പോലെ.അമ്പലത്തിനുള്ളിൽ ഗണേശനെ കാണാവുന്ന രീതിയിൽ ഒരിടത്തിരുന്നു ഗണേശ സ്തുതികൾ ചൊല്ലുമ്പോൾ ക്ഷേത്രത്തിനു വലംവെച്ചു തൊഴുതു വരുന്ന ഒരു ചെറുപ്പക്കാരൻ അവളെതന്നെ നോക്കുന്നത് അവൾ കണ്ടു. ആദ്യം അതത്ര കാര്യമാക്കിയില്ലെങ്കിലും അയാളുടെ നോട്ടം പുഞ്ചിരിയിലേക്ക് വഴി മാറിയപ്പോൾ അവൾ ഇരുന്നിടത്തുനിന്നും എഴുന്നേറ്റ് ഗണേശനെ തൊഴുത് പുറത്തേക്കിറങ്ങി. ഗൗരി. അവൾ ക്ഷേത്ര മുറ്റത്തേക്കിറങ്ങുമ്പോൾ പിന്നിൽ നിന്നാരോ വിളിച്ചു. തിരിഞ്ഞു നോക്കാതെ തന്നെ അവൾക്ക് മനസ്സിലായി അകത്തു വെച്ചു കണ്ട ആൾ തന്നെയാണ് തന്നെ വിളിച്ചതെന്നു. അവൾ തിരിഞ്ഞു നോക്കി. അയാളും അവൾക്കൊപ്പം നടന്നെത്തി. എന്നെ മനസ്സിലായോ. അയാളുടെ ചോദ്യവും കുസൃതി നിറഞ്ഞ നോട്ടവും അവളുടെ ചുണ്ടിലും ഒരു പുഞ്ചിരി നിറച്ചു. ഇന്നെന്നെ കാണാൻ വരുമെന്ന് പറഞ്ഞ കോന്തനല്ലേ. അവളുടെ മറുപടി കേട്ട് അയാൾ പൊട്ടിച്ചിരിച്ചു. അവൾക്കും ചിരി വന്നു. ഹാ അപ്പോൾ മനസ്സിലായല്ലേ. പെണ്ണുകാണലിന്റെ ചമ്മൽ ഒഴിവാക്കാം എന്നു കരുതിയാണ് താൻ അമ്പലത്തിൽ പോയെന്നു പറഞ്ഞപ്പോൾ ഞാനും ഇങ്ങോട്ട് പോന്നത്. കുറച്ചധിക നേരം സംസാരിയ്ക്കുകയും ചെയ്യാമല്ലോ. അവർ ഒന്നിച്ചു മുന്നോട്ട് നടന്നു. എനിയ്ക്ക് തന്നോട് കുറച്ചു കാര്യങ്ങൾ പറയാനുണ്ടായിരുന്നു. തനിയ്ക്കും പറയാൻ കാണുമെന്നറിയാം. വീട്ടുകാർ എല്ലാം തീരുമാനിച്ചുറപ്പിച്ച മട്ടാണ്. പക്ഷെ ഞാനിപ്പോൾ ഒരു കല്യാണം കഴിയ്ക്കാനുള്ള മാനസികാവസ്ഥയിലല്ല. കാരണം ഞാൻ പറയാതെ തന്നെ തനിയ്ക്ക് ഊഹിയ്ക്കാം. തനിയ്ക്ക് പതിനെട്ടു വയസ്സു തികഞ്ഞിട്ടില്ല. എനിയ്ക്കും ഇരുപത്തിമൂന്ന് വയസ്സ് ആകുന്നതെയുള്ളൂ. വീട്ടുകാരുടെ കണ്ണിൽ നമ്മൾ വളർന്നെങ്കിലും നമുക്ക് അറിയാമല്ലോ നമ്മുടെ അവസ്ഥ. അതുകൊണ്ട് ഒരു അഡ്ജസ്റ്റ്മെന്റിൽ നമുക്ക് അവരോട് സംസാരിയ്ക്കാം. വളരെ സമാധാനത്തോടെ നമ്മുടെ തീരുമാനം അറിയിക്കാം. അയാൾ പറഞ്ഞതു കേട്ടപ്പോൾ ഗൗരിയുടെ കണ്ണുകൾ തിളങ്ങി. അവൾ തിരിഞ്ഞു ക്ഷേത്രത്തിലേക്കൊന്നു നോക്കി. ഗണേശന്റെ മുന്നിൽ കത്തി നിൽക്കുന്ന നിലവിളക്കിന്റെ നാളമൊന്നുലഞ്ഞു. അവൾക്കത് കണ്ടപ്പോൾ മനസ്സു നിറഞ്ഞു. ഞാനിനി പറയാൻ പോകുന്ന കാര്യങ്ങൾ താൻ കൂടി സമ്മതിച്ചാലെ നടക്കു. അയാൾ ഗൗരിയുടെ മുഖത്തേക്ക് നോക്കി. അവൾ എന്താണെന്ന അർത്ഥത്തിൽ അവനെ നോക്കി. എനിയ്ക്ക് തന്നെ ഒറ്റനോട്ടത്തിൽ തന്നെ ഇഷ്ടമായി. അതുകൊണ്ട് നമ്മുടെ വിവാഹത്തിന് ഞാനൊരിക്കലും എതിർപ്പ് പറയില്ല. നമുക്ക് നമ്മുടെ വീട്ടുകാരുടെ മുന്നിൽ വച്ചൊരു താലികെട്ടി കല്യാണം നടത്താം. തന്റെ പഠിത്തം കഴിഞ്ഞൊരു ജോലിയൊക്കെ ആകുമ്പോഴേക്കും ഞാനും നല്ല രീതിയിൽ സെറ്റിലാകും. അതുകഴിഞ്ഞ് നാട്ടുകാരുടെയും ബന്ധുക്കളുടെയും മുന്നിൽ വെച്ചു ആർഭാടമായി നമുക്ക് നമ്മുടെ വിവാഹം നടത്താം. അതുവരെ നമുക്ക് പ്രേമിച്ചു നടക്കാമെടോ. വലിയൊരു കാര്യം നിസ്സാരമായി തമാശപോലെ പറഞ്ഞതു കേട്ടപ്പോൾ ഗൗരിയ്ക്ക് ചിരിവന്നു. താനെന്താ ചിരിച്ചത്. അവൻ ചോദിച്ചു. അവന്റെ ചോദ്യം കേട്ട് അവൾ അവനെ നോക്കി. ഇന്നലെ രാത്രി ഉറക്കം വരാതെ തിരിഞ്ഞും മറിഞ്ഞും കിടക്കുമ്പോൾ ഞാനും ഇതുപോലൊക്കെ ചിന്തിച്ചിരുന്നു. ജാതകമാണല്ലോ ഒരു പെണ്ണിന്റെ ജീവിതം നിശ്ചയിക്കുന്നത് എന്നു തോന്നിപ്പോയി. എന്റെ അതേ മാനസികാവസ്ഥയിൽ തന്നെ ഏട്ടനും ചിന്തിച്ചു. ഇതു നമ്മുടെ വീട്ടുകാർ സമ്മതിയ്ക്കുമെങ്കിൽ എനിയ്ക്കും എതിർപ്പൊന്നുമില്ല. ഗൗരിയുടെ പ്രായത്തിൽ കവിഞ്ഞ പക്വതയോടെയുള്ള മറുപടി അവനിൽ സന്തോഷം നിറച്ചു. എനിയ്ക്കൊരു ടീച്ചർ ആകണമെന്നാണ് ആഗ്രഹം. പ്ലസ്ടു കഴിഞ്ഞ് റ്റിറ്റിസി എടുത്തിട്ട് ബി എഡ് ചെയ്യണമെന്നൊക്കെയാണ് മോഹം. ഒരു ടീച്ചർ ആയി കഴിയുമ്പോൾ നല്ല ആലോചനകൾ വരും എന്നെ നന്നായി മനസ്സിലാക്കുന്ന ഒരാളെ വിവാഹം കഴിയ്ക്കണം എന്നൊക്കെ മനസ്സിൽ കരുതിയിരുന്നു. ഇതിപ്പോൾ ആദ്യമേ അങ്ങനെയൊരാളെ എന്റെ ഗണേശൻ എന്റെ മുന്നിൽ എത്തിച്ചുതന്നു. ഗൗരി പറഞ്ഞതു കേട്ടപ്പോൾ അയാളൊന്നു ചിരിച്ചു. എന്തേ ചിരിച്ചത്. അവളുടെ ചോദ്യം കേട്ടപ്പോൾ അവൻ അവൾക്കഭിമുഖമായി നിന്നു. എന്റെ പേര് ഗണേഷ് എന്നാണ്. അതുകേട്ടപ്പോൾ ഗൗരിയുടെ കണ്ണുകൾ നിറഞ്ഞു. താനൊരു ഗണപതി ഭക്തയാണെന്നു തന്റെ വീട്ടിൽ ചെന്നപ്പോൾ അച്ഛമ്മയും അമ്മയും പറഞ്ഞു. തന്റെ ഉണ്ണിഗണപതിയെ കാണിച്ചു തരികയും ചെയ്തു. അപ്പോൾ തന്നെ ഞാൻ മനസ്സിൽ ഉറപ്പിച്ചിരുന്നു എന്നെയും തനിയ്ക്ക് ഇഷ്ടമാകുമെന്നു. അതോ അങ്ങനെ അല്ലാന്നുണ്ടോ ഗണേഷിന്റെ ചോദ്യം കേട്ടപ്പോൾ അവൾ തന്റെ കൈയിലിരുന്ന ഉണ്ണിയപ്പത്തിൽ ഒരെണ്ണം അവനു നേരെ നീട്ടി. ഗണേശന്റെ നേദ്യ പ്രസാദമാണ്. അവളുടെ ഇഷ്ടം ആ നിവേദ്യത്തിലൂടെ അവനു മനസ്സിലായി. ദേ വീടെത്തി. അപ്പോൾ നമ്മൾ നമ്മുടെ അഭിപ്രായത്തിൽ ഉറച്ചു നിൽക്കുകയല്ലേ. ഗണേഷ് ചോദിച്ചപ്പോൾ അവൾ അതെയെന്ന് സമ്മതം മൂളി. അവർ ഒന്നിച്ചു നടന്നു വരുന്നത് കണ്ടപ്പോൾ തന്നെ രണ്ടു വീട്ടുകാർക്കും മനസ്സു നിറഞ്ഞു. അവർക്കും സമ്മതമാണെന്നു രണ്ടുപേരുടെയും മുഖത്തു നിന്നും അവർ വായിച്ചെടുത്തു. അപ്പോൾ നമ്മൾ തീരുമാനിച്ചത് പോലെ നടത്താം. അല്ലെ ദിവാകരാ. ഗണേഷിന്റെ അച്ഛൻ പരമേശ്വരൻ ദിവാകരനോട് ചോദിച്ചു. അതിനുള്ള മറുപടി ഗണേഷാണ് പറഞ്ഞത്. എനിയ്ക്കും ഗൗരിയ്ക്കും ഒരു കാര്യം പറയാനുണ്ട്. എല്ലാവരും അവരെ രണ്ടുപേരെയും മാറി മാറി നോക്കി. എന്താ മോനെ. നിങ്ങൾക്ക് താല്പര്യക്കുറവ് എന്തെങ്കിലുമുണ്ടോ. ദിവാകരന്റെ ചോദ്യം കേട്ടപ്പോൾ തല കുനിച്ചു നിന്ന ഗൗരി അകത്തേക്ക് പോകാനൊരുങ്ങി. താൻ നിൽക്ക്. അഭിപ്രായം പറയാൻ തനിയ്ക്കും അവകാശമുണ്ട്. ഇതു നമ്മുടെ ജീവിതമാണ്. ഗണേഷിന്റെ ശബ്ദം ഉറച്ചതായിരുന്നു. എന്താ മോനെയിത്. നിങ്ങൾക്ക് ഇഷ്ടമല്ല എന്നുണ്ടോ. ഗണേശന്റെ അമ്മ സത്യഭാമ അവന്റെ കൈയ്യിൽ പിടിച്ചുകൊണ്ട് ചോദിച്ചു. എനിയ്ക്ക് ഗൗരിയെ ഇഷ്ടമായി. ഗൗരിയ്ക്ക് എന്നെയും. ഞങ്ങളിനി പിന്മാറാനും തയ്യാറല്ല. അവന്റെ മറുപടി കേട്ടപ്പോൾ ഇരുകൂട്ടർക്കും സന്തോഷമായി. മൂടിക്കെട്ടിയ മുഖങ്ങളെല്ലാം തെളിഞ്ഞു. പിന്നെന്താ പ്രശ്നം. പരമേശ്വരൻ ചോദിച്ചു. പ്രശ്നം ഞങ്ങളുടെ പ്രായം തന്നെയാണ്. ഒന്നുമറിയാത്ത പ്രായത്തിൽ കുടുംബം നടത്തി ഡിവോഴ്സ് ആകുന്നതിലും നല്ലത് . ഇപ്പോഴേ അതിനൊരു തീരുമാനമുണ്ടാക്കുന്നതല്ലേ. ഗണേഷ് പറഞ്ഞു വരുന്നത് എന്താണെന്ന് മനസ്സിലാവാതെ എല്ലാവരും അവനെതന്നെ നോക്കി. ഇപ്പോൾ നിങ്ങൾ തീരുമാനിച്ചതുപോലെ അതേ തീയതിയിൽ ഞാൻ ഗൗരിയുടെ കഴുത്തിൽ താലി കെട്ടാം. പക്ഷെ അത് ഈ വീടിനുള്ളിൽ ഇത്രയും പേരുടെ മുന്നിൽ വെച്ചു മാത്രമായിരിക്കും. ഗൗരിയുടെ ആഗ്രഹം പോലെ അവൾ പഠിച്ചു ഒരു ടീച്ചർ ആകുമ്പോഴേക്കും ഞാനും എന്റെ ജോലിയിൽ ഞാൻ ആഗ്രഹിച്ച സ്ഥാനത്തേക്ക് എത്തും. അതുവരെ ഞങ്ങൾ നിങ്ങളുടെ അനുവാദത്തോടെ പ്രണയിച്ചു നടന്നോളാം. അതിനുശേഷം നാട്ടുകാരുടെയും ബന്ധുക്കളുടെയും മുന്നിൽവെച്ച് ആർഭടമായി വിവാഹം നടത്തി ഞാൻ ഗൗരിയെ എന്റെ വീട്ടിലേക്ക് കൊണ്ടുപോയ്‌ക്കോളാo. ഗണേഷ് അതു പറയുമ്പോൾ എല്ലാവരുടെയും നോട്ടം ഗൗരിയിലായിരുന്നു.ഇതു നിന്റെ മാത്രം അഭിപ്രായമാണോ. അതോ. പരമേശ്വരൻ ചോദിച്ചു. അല്ല അച്ഛാ. ഞങ്ങളുടെ രണ്ടുപേരുടെയും തീരുമാനമാണിത്. ജാതകത്തിൽ ഉള്ള ദോഷം തീരാൻ വിവാഹം കഴിച്ചാൽ പോരെ ഇപ്പോൾ. ജീവിതം തുടങ്ങുന്നത് എപ്പോൾ വേണമെങ്കിലും ആകാമല്ലോ. നിങ്ങളുടെ കണ്ണിൽ ഞങ്ങൾ വലിയ കുട്ടികളായെങ്കിലും ഞങ്ങൾക്കല്ലേ അറിയൂ ഞങ്ങളുടെ അവസ്ഥ. ഗണേശേട്ടന്റെ അഭിപ്രായം തന്നെയാണ് എനിയ്ക്കും. നിങ്ങൾക്കിതിൽ എതിർപ്പുണ്ടെങ്കിൽ നമുക്ക് ഈ ആലോചന ഇവിടെ വെച്ചുതന്നെ അവസാനിപ്പിയ്ക്കാം. ഗൗരിയത് പറയുമ്പോൾ അവളുടെ കണ്ണുകൾ നിറഞ്ഞിരുന്നു. അത് ഗണേഷ് കാണുകയും ചെയ്തു. ഒരു മറുപടിയ്ക്കായി അവർ എല്ലാവരുടെയും മുഖത്തേക്ക് മാറി മാറി നോക്കി. ഞങ്ങൾക്ക് സമ്മതമാണ്. ഒന്നും ആലോചിയ്ക്കാതെ തന്നെ അച്ഛമ്മ മറുപടി പറഞ്ഞു എന്റെ കുഞ്ഞിന്റെ മനസ്സറിഞ്ഞു പ്രവർത്തിയ്ക്കാൻ കാണിച്ച മോന്റെ വലിയ മനസ്സു കാണാതെ പോകരുത് നിങ്ങൾ. പതിനെട്ടു പോലും തികയാത്ത എന്റെ കുഞ്ഞിന്റെ മനസ്സെന്താണെന്നു എനിയ്ക്ക് മനസ്സിലാകും. കാരണം ഞാനൊരു ആധ്യാപികയായിരുന്നു. അവർ കാത്തിരിയ്ക്കാൻ തയ്യാറാണെങ്കിൽ നമുക്കിത് അവർ പറഞ്ഞ രീതിയിൽ തന്നെ മുന്നോട്ട് കൊണ്ടുപോയ്ക്കൂടെ. സൗദാമിനിയമ്മ പറഞ്ഞതു കേട്ടപ്പോൾ ദിവകരനും പരമേശ്വരനും പരസ്പരം നോക്കി ഞങ്ങൾക്കും എതിർപ്പൊന്നുമില്ല. അവരുടെ ജീവിതം അവരല്ലേ തീരുമാനിയ്ക്കേണ്ടത്. പരമേശ്വരൻ കൂടി സമ്മതം അറിയിച്ചതോടെ ആ വീട്ടിൽ മൂടിക്കെട്ടി നിന്ന അന്തരീക്ഷം ഒന്നയഞ്ഞു. അന്ന് ഇരുവീട്ടുകാരും യാത്ര പറഞ്ഞു പിരിയുമ്പോൾ ഗണേഷും ഗൗരിയും സന്തോഷത്തിന്റെ കൊടുമുടികൾ കയറുകയായിരുന്നു. ജ്യോൽസ്യൻ കുറിച്ചു തന്ന തീയതിയിൽ ചെറിയൊരു കല്യാണത്തിനായി ഗൗരിയുടെ വീടൊരുങ്ങി. നാദസ്വരം റെക്കോർഡറിൽ പ്ലെ ചെയ്തു. പെണ്ണുകാണലിനുള്ളവരിൽ അധികമായി ലക്ഷ്മിയും ഭർത്താവും മാത്രം ഉണ്ടായിരുന്നു അവിടെ. ഗണേഷും അച്ഛനും അമ്മയും കൃത്യ സമയത്തു തന്നെ എത്തി. കാർമ്മികത്വം വഹിച്ച പൂജാരിയുടെ നിർദ്ദേശപ്രകാരം നവവധുവിനെ ഗണേഷിനരുകിൽ കൊണ്ടിരുത്തിയത് ലക്ഷ്മിയാണ്. അധികം ആഭരങ്ങളൊന്നുമണിയാതെയും മുഖത്തു കൃത്രിമ ചായങ്ങളൊന്നുമില്ലാതെയും ചുവന്ന പട്ടുസാരിയിൽ ഒരുങ്ങി വന്ന ഗൗരിയെ കണ്ടപ്പോൾ ഗണേഷിന്റെ ഉള്ളു തുടികൊട്ടി. അവനവളുടെ കൈയ്യിൽ മുറുകെ പിടിച്ചു. അവളവനെ നോക്കി പുഞ്ചിരിച്ചു. അച്ഛനെടുത്തു കൊടുത്ത താലി എല്ലാവരുടെയും അനുവാദത്തോടെ അവനവളുടെ കഴുത്തിൽ കെട്ടിക്കൊടുത്തു. ഭാനുവും സത്യഭാമയും നിറകണ്ണുകൾ സാരിതുമ്പുകൊണ്ട് തുടച്ചു. സദ്യയും കഴിച്ചു ഉച്ചയ്ക്ക് ശേഷം ഗണേഷ് യാത്ര പറയാൻ ഗൗരിയുടെ മുറിയിലെത്തുമ്പോൾ അവളുടെ സീമന്ത രേഖയിൽ അവനണിയിച്ച സിന്ദൂരം തിളങ്ങുന്നതുപോലെ തോന്നിയവന്. തന്റെ ആഗ്രഹങ്ങളും എന്റെ സ്വപ്നങ്ങളും നിറവേറിക്കഴിയുമ്പോൾ ഞാൻ വരും തന്നെ എന്നന്നേക്കുമായി എന്റെ സ്വന്തമാക്കാൻ. എല്ലാവരുടെയും അനുഗ്രഹത്തോടെ അന്ന് നമുക്കൊരു ജീവിതം തുടങ്ങാം. അവനവളെ തന്റെ നെഞ്ചോട് ചേർത്തു നിർത്തി നെറുകയിൽ ചുണ്ടുകളമർത്തി. അവളുടെ അടഞ്ഞ കണ്ണിണകളിലൂടെ ഒഴുകിയിറങ്ങിയ മണിമുത്തുകൾ താടിയിലൂടെ ഊർന്നു അവൻ ചാർത്തിയ താലിയെ കുളിരണിയിച്ചു. അന്ന് ആളുകൾക്ക് മുന്നിൽ വച്ചൊരു നാടകമാണ് നടത്തുന്നതെന്ന് കരുതിയാൽ മതി. ഇന്നായിരുന്നു ആ കല്യാണം. നമ്മൾ മനസ്സിൽ ആഗ്രഹിച്ച . മനസ്സാൽ ഒന്നായ കല്യാണം. മനസ്സു വിഷമിപ്പിയ്ക്കരുത്. ഒരു ഭാര്യയാണ് താനെന്ന ചിന്ത വേണ്ട. താൻ എങ്ങനെയായിരുന്നു ഇന്നലെവരെ അതേപോലെ തന്നെ ഇനിയും മുന്നോട്ടു പോയാൽ മതി. എപ്പോഴും സന്തോഷത്തോടെ ഇരിയ്ക്കണം. എനിയ്ക്കു കാണണമെന്ന് തോന്നുമ്പോഴൊക്കെ ഞാൻ വന്നു കണ്ടോളാo. ഇപ്പോൾ ഇറങ്ങട്ടെ. അവനവളുടെ കണ്ണുകൾ തുടച്ചു കൊടുത്തു. കൈകളിൽ മുറുകെ പിടിച്ചു. ഗണേശിന്റെ കാർ അകന്നു പോകുന്നതും നോക്കി തന്റെ മുറിയുടെ ജനലോരം നിൽക്കുമ്പോൾ അവളവളുടെ ഉണ്ണിഗണപതിയോട് മനസ്സു നിറഞ്ഞു നന്ദി പറഞ്ഞു. തന്റെ ഭാവി തനിയ്ക്ക് മടക്കി തന്നതിന്. തന്റെ സ്വപ്നങ്ങൾ തനിയ്ക്ക് മടക്കി തന്നതിന്. അവളാ പഞ്ചലോഹ വിഗ്രഹത്തിലേക്കു നോക്കിയപ്പോൾ സന്തോഷം നിറഞ്ഞൊരു കുസൃതി ചിരി തന്റെ കുടവയറന്റെ മുഖത്തു തെളിഞ്ഞത് അവൾ കണ്ടു. അവളുടെ ചുണ്ടുകളിലും ഒരു പുഞ്ചിരി വന്നു തത്തിക്കളിച്ചു."

# Split the long string per line and put in a list
corpus = data.lower().split("\n")
mal_corpus = data_mal.split("\n")
mal_corpus_cleaned = data_mal_cleaned.split("\n") + oru_paatu_cleaned.split("\n") + krishna_nee_ariyumo_enne.split(
    "\n") + renuka.split("\n")
mal_corpus_cleaned = kadha_jalakam_1.split(".")

print(f"Length of corpus {len(corpus)}")
print(f"Length of malayalam corpus {len(mal_corpus)}")
print(f"Length of malayalam corpus {len(mal_corpus_cleaned)}")
print(f"The corpus:\n{corpus}")
print(f"The malayalam corpus:\n{mal_corpus}")
print(f"The cleaned malayalam corpus:\n{mal_corpus_cleaned}")

# Initialize the Tokenizer
tokenizer = Tokenizer()
tokenizer_mal = Tokenizer()
tokenizer_mal_cleaned = Tokenizer()

tokenizer.fit_on_texts(corpus)
tokenizer_mal.fit_on_texts(mal_corpus)
tokenizer_mal_cleaned.fit_on_texts(mal_corpus_cleaned)

total_words = len(tokenizer.word_index) + 1
total_words_mal = len(tokenizer_mal.word_index) + 1
total_words_mal_cleaned = len(tokenizer_mal_cleaned.word_index) + 1

print(f"Total words in corpus : {total_words}")
print(f"Total words in malayalam corpus : {total_words_mal}")
print(f"Total words in cleaned malayalam corpus : {total_words_mal_cleaned}")

# Initialize the sequences list
input_sequences = []
for line in corpus:
    token_list = tokenizer.texts_to_sequences([line])[0]
    for i in range(1, len(token_list)):
        n_gram_sequence = token_list[:i + 1]
        input_sequences.append(n_gram_sequence)
max_sequence_len = max([len(x) for x in input_sequences])

# Pad all sequences
input_sequences = np.array(pad_sequences(input_sequences, maxlen=max_sequence_len, padding='pre'))
xs, labels = input_sequences[:, :-1], input_sequences[:, -1]
ys = tf.keras.utils.to_categorical(labels, num_classes=total_words)

input_sequences_mal = []
for line in mal_corpus_cleaned:
    token_list = tokenizer_mal_cleaned.texts_to_sequences([line])[0]
    for i in range(1, len(token_list)):
        n_gram_sequence_mal = token_list[:i + 1]
        input_sequences_mal.append(n_gram_sequence_mal)
max_sequence_len_mal = max([len(x) for x in input_sequences_mal])

# Pad all sequences
input_sequences_mal = np.array(pad_sequences(input_sequences_mal, maxlen=max_sequence_len_mal, padding='pre'))
xs_mal, labels_mal = input_sequences_mal[:, :-1], input_sequences_mal[:, -1]
ys_mal = tf.keras.utils.to_categorical(labels_mal, num_classes=total_words_mal_cleaned)
# print(xs_mal, labels_mal)

sentence = corpus[0].split()
print(f'sample sentence: {sentence}')

# Initialize token list
token_list = []

# Look up the indices of each word and append to the list
for word in sentence:
    token_list.append(tokenizer.word_index[word])

# Print the token list
print(token_list)
# Pick element
elem_number = 6

# Print token list and phrase
print(f'token list: {xs[elem_number]}')
print(f'decoded to text: {tokenizer.sequences_to_texts([xs[elem_number]])}')

# Print label
print(f'one-hot label: {ys[elem_number]}')
print(f'index of label: {np.argmax(ys[elem_number])}')

# Pick element
elem_number = 5

# Print token list and phrase
print(f'token list: {xs[elem_number]}')
print(f'decoded to text: {tokenizer.sequences_to_texts([xs[elem_number]])}')

# Print label
print(f'one-hot label: {ys[elem_number]}')
print(f'index of label: {np.argmax(ys[elem_number])}')

# Build the model
model_mal = Sequential([
    Embedding(total_words, 100, input_length=max_sequence_len_mal - 1),
    Bidirectional(LSTM(32, return_sequences=True)),
    Bidirectional(LSTM(32)),
    Dense(total_words_mal_cleaned, activation='softmax')
])

model_mal1 = Sequential([
    Embedding(total_words_mal_cleaned, 64, input_length=max_sequence_len_mal - 1),
    Bidirectional(LSTM(20)),
    Dense(total_words_mal_cleaned, activation='softmax')
])

# Use categorical crossentropy because this is a multi-class problem
# model.compile(loss='categorical_crossentropy', optimizer='adam', metrics=['accuracy'])
model_mal.compile(loss='categorical_crossentropy', optimizer='adam', metrics=['accuracy'])

# Print the model summary
# model.summary()
model_mal.summary()

# Train the model
# history = model.fit(xs, ys, epochs=500)
history_mal = model_mal.fit(xs_mal, ys_mal, epochs=500)


# history = model.fit(xs_mal, ys_mal, epochs=500)


# Plot utility
def plot_graphs(history, string):
    plt.plot(history.history[string])
    plt.xlabel("Epochs")
    plt.ylabel(string)
    plt.show()


# Visualize the accuracy
plot_graphs(history_mal, 'accuracy')
#
# seed_text = "Laurence went to Dublin"
#
# # Define total words to predict
# next_words = 10
#
# # Loop until desired length is reached
# for _ in range(next_words):
#
#     # Convert the seed text to a token sequence
#     token_list = tokenizer.texts_to_sequences([seed_text])[0]
#
#     # Pad the sequence
#     token_list = pad_sequences([token_list], maxlen=max_sequence_len - 1, padding='pre')
#
#     # Feed to the model and get the probabilities for each index
#     probabilities = model.predict(token_list)
#
#     # Pick a random number from [1,2,3]
#     choice = np.random.choice([1, 2, 3])
#
#     # Sort the probabilities in ascending order
#     # and get the random choice from the end of the array
#     predicted = np.argsort(probabilities)[0][-choice]
#
#     # Ignore if index is 0 because that is just the padding.
#     if predicted != 0:
#         # Look up the word associated with the index.
#         output_word = tokenizer.index_word[predicted]
#
#         # Combine with the seed text
#         seed_text += " " + output_word
#
# # Print the result
# print(seed_text)
#
#


# seed_text = "ഒരു രാത്രിമഴ"
seed_text = "എല്ലാം നന്നായി"

# Define total words to predict
next_words = 100

# Loop until desired length is reached
for _ in range(next_words):

    # Convert the seed text to a token sequence
    token_list = tokenizer_mal_cleaned.texts_to_sequences([seed_text])[0]

    # Pad the sequence
    token_list = pad_sequences([token_list], maxlen=max_sequence_len_mal - 1, padding='pre')

    # Feed to the model and get the probabilities for each index
    probabilities = model_mal.predict(token_list)

    # Pick a random number from [1,2,3]
    choice = np.random.choice([1, 2, 3])

    # Sort the probabilities in ascending order
    # and get the random choice from the end of the array
    predicted = np.argsort(probabilities)[0][-choice]

    # Ignore if index is 0 because that is just the padding.
    if predicted != 0:
        # Look up the word associated with the index.
        output_word = tokenizer_mal_cleaned.index_word[predicted]

        # Combine with the seed text
        seed_text += " " + output_word

# Print the result
print(seed_text)
